app/views/farms/index.html.erb

		<div class="flex-items-default-saleButtons">
			<% @farm =  Farm.find_by(id: list) %>
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]