app/views/farms/show.html.erb

<div align="center" style="min-height:800px; width:100%;display:block;overflow:auto;">
<% @farm = Farm.find_by_id(params[:id]) %>
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]

	<% @salesArray = Array.new [] %>
	<% @horses = Horse.where(:farm => @farm.id).all %>
	<% @horses2 = Horse.where(:farm2 => @farm.id).all %>
	<% @sales = Sale.order(StartDate: :asc) %>
---
SELECT "horses".* FROM "horses" WHERE "horses"."farm" = ?  [["farm", "32"]]
SELECT "horses".* FROM "horses" WHERE "horses"."farm2" = ?  [["farm2", "32"]]
SELECT "sales".* FROM "sales" ORDER BY "sales"."StartDate" ASC

			<% @uniqueSale.each do |sale| %>
				<% @saleDetails = Sale.find(sale) %>
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]

						<tbody>
						<% @horses = Horse.all %>
---
SELECT "horses".* FROM "horses"

								<% else %>
									<% @sireResults = Sire.find_by(id: horse.sire)  %>
---
SELECT "sires".* FROM "sires" WHERE "sires"."id" = ? LIMIT ?  [["id", 120], ["LIMIT", 1]]