app/views/horses/show.html.erb

<!----- increment social count ----->
<% Horse.increment_counter(:PageViews, @horse.id) %>
---
UPDATE "horses" SET "PageViews" = COALESCE("PageViews", 0) + ? WHERE "horses"."id" = ?  [["PageViews", 1], ["id", 6148]]

<% if !@horse.farm2.nil? && @horse.farm2 != "" %>
	<% @farm = Farm.find(@horse.farm) %>
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

		<% if @horse.Sale.to_i.is_a? Numeric %>
		<% @saleName = Sale.find(@horse.Sale.to_i) %>
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

					<% else %>
						<% @sire = Sire.find(@horse.sire)%>
---
SELECT "sires".* FROM "sires" WHERE "sires"."id" = ? LIMIT ?  [["id", 306], ["LIMIT", 1]]