app/views/mains/index.html.erb

SELECT "sales".* FROM "sales"
SELECT "farms".* FROM "farms"
---
		<br>
		<% @sale = Sale.all %>
		<% @farm = Farm.all %>

SELECT "sires".* FROM "sires"
---

					<% @sires = Sire.all %>