app/controllers/dwnlds_controller.rb

 def new
  # redirect_to :back, notice: "Verified"
# To get the code below to work, make sure that the yaml and aws.rb files are either deleted or have
# the correct access_key_id/secret_access_key/bucket or this will fail.
  # if  !params[:worker]
  # redirect_to "http://curl.se"
    # # redirect_back fallback_location: "http://www.yearlingvideos.com"
  # end
  ####### 2022#

  #initiate the client
  s3 = Aws::S3::Client.new({
      region:            'us-east-2',
      access_key_id:     '',
      secret_access_key: 'SgoR4/o9vRPip69daNu9CXRYrHHMFBcrjb5j/kev'
  })
  #Get the object
    Aws.use_bundled_cert!
    @horse = Horse.find_by(BulkUploadVideoName: params[:filename])
    Horse.increment_counter(:e_count, @horse.id)
---
SELECT "horses".* FROM "horses" WHERE "horses"."BulkUploadVideoName" = ? LIMIT ?  [["BulkUploadVideoName", "21fs1.mp4"], ["LIMIT", 1]]
UPDATE "horses" SET "e_count" = COALESCE("e_count", 0) + ? WHERE "horses"."id" = ?  [["e_count", 1], ["id", 6141]]