app/controllers/farms_controller.rb

  def show
      @farm = Farm.find(params[:id])
      @sale = Sale.all
    respond_to do |format|
      format.html
      format.pdf do
        sale = Sale.find(params[:e])
---
SELECT "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]