app/controllers/mains_controller.rb

  def index
    @horses = Horse.where("created_at > ?", Time.now-4.days).order!  'created_at DESC'
    @farms = Farm.all
    @sales = Sale.all
---
SELECT "horses".* FROM "horses" WHERE (created_at > '2024-12-10 16:12:32.473582') ORDER BY created_at DESC
SELECT "farms".* FROM "farms"
SELECT "sales".* FROM "sales"