app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
    def set_sale
      @sale = Sale.find(params[:id])