app/views/dwnlds/index.html.erb


<% @sales = Sale.order(StartDate: :asc) %>
---
SELECT "sales".* FROM "sales" ORDER BY "sales"."StartDate" ASC

		<div style="width: 40%; margin:0 auto;""align="center">
		<% @horses = Horse.where(:Sale => sale.id).all %>
---
SELECT "horses".* FROM "horses" WHERE "horses"."Sale" = ?  [["Sale", "3"]]