app/views/sales/index.html.erb

<div class= "flex-container-saleButtons">
	<% @sales = Sale.order(StartDate: :asc) %>
---
SELECT "sales".* FROM "sales" ORDER BY "sales"."StartDate" ASC

	<% horseList.each do |list| %>
	<% @sale =  Sale.find_by(id: list) %>
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]