app/views/sales/show.html.erb

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
</style>
	<% @sale = Sale.find_by_id(params[:id]) %>

SELECT "horses".* FROM "horses" WHERE "horses"."Sale" = ?  [["Sale", "6"]]
---
<div class="flex-item-1c">
		<% @horses = Horse.where(:Sale => @sale.id).all %>